# Use `brew bundle` to install the packages listed below

# Packages
brew 'ack'
brew 'watch'
brew 'wget'
brew 'git'
brew 'colordiff'
brew 'tmux'
brew 'starship'
brew 'jq'
brew 'htop'
brew 'vim'
brew 'diffr'
brew 'atuin'
# brew 'aha' # shell escape codes to html (Uebersicht.app)

# CLIs
brew 'kubectl'
brew 'wireguard-tools'
brew 'fnm'
brew 'flyctl
tap 'hashicorp/tap'
brew 'hashicorp/tap/terraform'

# Apps
#cask 'alacritty'

# Fonts
#tap 'homebrew/cask-fonts'
#tap 'homebrew/cask'
#tap 'robertgzr/homebrew-tap'
#brew 'iosevka', args: ['with-ss05', 'with-termlig']
#brew 'iosevka', args: ['with-ss12', 'with-termlig']

# Applications
# tap 'caskroom/cask'
# cask_args appdir: '/Applications'

# Quick Look plugins
# cask 'qlcolorcode'
# cask 'qlstephen'
# cask 'qlmarkdown'
# cask 'quicklook-json'
# cask 'quicklook-csv'
