# Use `brew bundle` to install the packages listed below

# Packages
brew 'ack'
brew 'watch'
brew 'wget'
brew 'fasd'
brew 'git'
brew 'colordiff'
brew 'tmux'
brew 'jq', args: ["HEAD"]
brew 'htop'
brew 'aha' # shell escape codes to html (Uebersicht.app)
brew 'vim'

# CLIs
brew 'terraform'
brew 'kubectl'
brew 'wireguard-tools'
brew 'fnm'

# Apps
#cask 'alacritty'

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-fira-code'
#cask 'font-m-plus'
cask 'font-hack'
#cask 'font-ubuntu'
cask 'font-input'
#cask 'font-iosevka'
#tap robertgzr/homebrew-tap
#cask 'font-iosevka-inziu' args: ['--with-ss05', '--with-termlig']

# Applications
# tap 'caskroom/cask'
# cask_args appdir: '/Applications'

# Quick Look plugins
# cask 'qlcolorcode'
# cask 'qlstephen'
# cask 'qlmarkdown'
# cask 'quicklook-json'
# cask 'quicklook-csv'
