# Use `brew bundle` to install the packages listed below

# Packages
brew 'ack'
brew 'vim', args: ['--with-override-system-vi']
brew 'watch'
brew 'wget'
brew 'fasd'
brew 'git'
brew 'colordiff'
brew 'tmux'
brew 'jq'
brew 'reattach-to-user-namespace' # used by tmux

# Apps
cask 'alacritty'

# Fonts
tap 'caskroom/fonts'
cask 'font-fira-code'
cask 'font-m-plus'
cask 'font-hack'
cask 'font-iosevka'
cask 'font-ubuntu'
# tap robertgzr/homebrew-tap
# cask 'font-iosevka-inziu' args: ['--with-ss05', '--with-termlig']

# Applications
tap 'caskroom/cask'
cask_args appdir: '/Applications'

# Quick Look plugins
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
